//
//  AnnoImage.hpp
//
//
/******************************************************************************************
本模块的作用在于，将计算的结果以可视化的方式打印在输入影像的拷贝上，便于查看算法的效果。
 
Author: Fu Xiaoqiang
Date:   2022/9/11
******************************************************************************************/

#ifndef ANNO_IMAGE_HPP
#define ANNO_IMAGE_HPP

#include<opencv2/opencv.hpp>

using namespace std;
using namespace cv;

#include "Common.hpp"


/******************************************************************************************
本函数的功能是，将468个人脸普通关键点的结果打印在输入影像的拷贝上。
*******************************************************************************************/
void AnnoGeneralKeyPoints(Mat& annoImage, const FaceInfo& faceInfo);

//-----------------------------------------------------------------------------------------

/******************************************************************************************
本函数的功能是，将一个眉毛处的71个关键点的结果打印在标注影像上。
*******************************************************************************************/
void AnnoOneEyeRefinePts(Mat& annoImage, const FaceInfo& faceInfo,
                         EyeID eyeID, const Scalar& drawColor);

/******************************************************************************************
本函数的功能是，将眉毛处的142个关键点的结果打印在标注影像上。
*******************************************************************************************/
void AnnoTwoEyeRefinePts(Mat& annoImage, const FaceInfo& faceInfo, const Scalar& drawColor);

//-----------------------------------------------------------------------------------------

/******************************************************************************************
本函数的功能是，将嘴唇处80个精细关键点的结果打印在标注影像上。
*******************************************************************************************/
void AnnoLipRefinePts(Mat& annoImage, const FaceInfo& faceInfo, const Scalar& drawColor);

//-----------------------------------------------------------------------------------------

/******************************************************************************************
本函数的功能是，将人脸关键点提取和位姿估计的结果打印在输入影像的拷贝上。
*******************************************************************************************/
void AnnoHeadPoseEst(Mat& annoImage, const FaceInfo& faceInfo);

#endif /* end of ANNO_IMAGE_HPP */
