//
//  Utils.hpp
//
//
/*
本模块依赖TinyEXIF来获取相机和输入影像的一些metadata。
 
Author: Fu Xiaoqiang
Date:   2022/9/15
*/

#ifndef EXIF_EXTRACTOR_HPP
#define EXIF_EXTRACTOR_HPP

using namespace std;


//-------------------------------------------------------------------------------------------

/**********************************************************************************************

***********************************************************************************************/
void ExtractEXIF(const char* srcImgFileName);

//-------------------------------------------------------------------------------------------


#endif /* end of EXIF_EXTRACTOR_HPP */
